NMMI/SoftHandPRO-and-Generic-FW-PSoC5/firmware.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "ADC.h"
#include "ADC_STATUS.h"
#include "DMA_dma.h"
#include "ADC_SOC.h"
#include "VOLTAGE_SENSE_aliases.h"
#include "VOLTAGE_SENSE.h"
#include "CURRENT_SENSE_1_aliases.h"
#include "CURRENT_SENSE_1.h"
#include "EMG_A_aliases.h"
#include "EMG_A.h"
#include "EMG_B_aliases.h"
#include "EMG_B.h"
#include "LED_RED_aliases.h"
#include "LED_RED.h"
#include "MOSI_aliases.h"
#include "MOSI.h"
#include "SCLK_aliases.h"
#include "SCLK.h"
#include "Chip_Select_A.h"
#include "MOTOR_1A_aliases.h"
#include "MOTOR_1A.h"
#include "MOTOR_EN_aliases.h"
#include "MOTOR_EN.h"
#include "PWM_MOTORS.h"
#include "CLOCK_PWM.h"
#include "MOTOR_1B_aliases.h"
#include "MOTOR_1B.h"
#include "MOTOR_DIR.h"
#include "EEPROM.h"
#include "FTDI_ENABLE_aliases.h"
#include "FTDI_ENABLE.h"
#include "RS485_CTS.h"
#include "USB_VDD_aliases.h"
#include "USB_VDD.h"
#include "MOTOR_ON_OFF.h"
#include "FTDI_ENABLE_REG.h"
#include "PACER_TIMER.h"
#include "RESET_FF.h"
#include "FF_STATUS.h"
#include "MY_TIMER.h"
#include "timer_clock.h"
#include "UART_RS485.h"
#include "RS_485_EN_aliases.h"
#include "RS_485_EN.h"
#include "ISR_RS485_RX.h"
#include "CLOCK_UART.h"
#include "CYCLES_TIMER.h"
#include "counter_cyc_clk.h"
#include "ISR_CYCLES.h"
#include "ENC_CS_aliases.h"
#include "ENC_CS.h"
#include "ENC_SCLK_aliases.h"
#include "ENC_SCLK.h"
#include "ENC_MISO_aliases.h"
#include "ENC_MISO.h"
#include "Bootloadable.h"
#include "emFile.h"
#include "CS0_aliases.h"
#include "CS0.h"
#include "MISO_aliases.h"
#include "MISO.h"
#include "RTC_IN_aliases.h"
#include "RTC_IN.h"
#include "RTC_OUT_aliases.h"
#include "RTC_OUT.h"
#include "RTC_Clock_aliases.h"
#include "RTC_Clock.h"
#include "RTC_CS_aliases.h"
#include "RTC_CS.h"
#include "SPI_IMU.h"
#include "SPI_IMU_PVT.h"
#include "CS2_aliases.h"
#include "CS2.h"
#include "CS1_aliases.h"
#include "CS1.h"
#include "BLINK_05HZ.h"
#include "LED_CTRL.h"
#include "BLINK_CTRL_EN.h"
#include "LED_GREEN_aliases.h"
#include "LED_GREEN.h"
#include "BLINK_25HZ.h"
#include "CLOCK_PWM_BLINK.h"
#include "EMG_1_aliases.h"
#include "EMG_1.h"
#include "EMG_2_aliases.h"
#include "EMG_2.h"
#include "EMG_3_aliases.h"
#include "EMG_3.h"
#include "EMG_4_aliases.h"
#include "EMG_4.h"
#include "EMG_5_aliases.h"
#include "EMG_5.h"
#include "EMG_6_aliases.h"
#include "EMG_6.h"
#include "ADC_AMux.h"
#include "ADC_Ext_CP_Clk.h"
#include "ADC_IRQ.h"
#include "ADC_theACLK.h"
#include "emFile_SPI0.h"
#include "emFile_SPI0_PVT.h"
#include "emFile_mosi0_aliases.h"
#include "emFile_mosi0.h"
#include "emFile_Clock_1.h"
#include "emFile_miso0_aliases.h"
#include "emFile_miso0.h"
#include "emFile_sclk0_aliases.h"
#include "emFile_sclk0.h"
#include "emFile_SPI0_CS_aliases.h"
#include "emFile_SPI0_CS.h"
#include "SPI_IMU_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

